A = imread('your-image'); %Ανάγνωση εικόνας

B = imresize(A, [600 , NaN],'bicubic'); %Αλλαγή μεγέθους εικόνας με ύψος 600 εικονοστοιχεία

Lab = rgb2lab(B); %Μετατροπή από RGB σε Lab

Labc = Lab(1:size(Lab,1)/2 , 1:size(Lab,2)/2,:); %Αποκοπή της εικόνας 
Labr=lab2rgb(Labc); %Μετατροπή από Lab σε RGB

L = Lab;
L(:,:,2:3) = 0; %Ρύθμιση των άλλων 2 συνιστωσών στη μέση της κλίμακάς τους
LR=lab2rgb(L); %Μετατροπή από Lab σε RGB
LRc = LR(1:size(LR,1)/2 , (size(LR,2)/2)+1:size(LR,2),:); %Αποκοπή της εικόνας 

a = Lab;
a(:,:,1) = 65; %Ρύθμιση της 1ης συνιστώσας στη μέση της κλίμακάς της
a(:,:,3) = 0; %Ρύθμιση της 3ης συνιστώσας στη μέση της κλίμακάς της
aR=lab2rgb(a); %Μετατροπή από Lab σε RGB
aRc = aR((size(aR,1)/2)+1:size(aR,1) , 1:size(aR,2)/2,:); %Αποκοπή της εικόνας 

b = Lab;
b(:,:,1) = 65; %Ρύθμιση της 1ης συνιστώσας στη μέση της κλίμακάς της
b(:,:,2) = 0; %Ρύθμιση της 2ης συνιστώσας στη μέση της κλίμακάς της
bR=lab2rgb(b); %Μετατροπή από Lab σε RGB
bRc = bR((size(bR,1)/2)+1:size(bR,1) , (size(bR,2)/2)+1:size(bR,2),:); %Αποκοπή της εικόνας 

figure;
I1 = cat(2,Labr,LRc); %Συννένωση των 2 πάνω εικόνων ως προς τον άξονα y
I2 = cat(2,aRc,bRc); %Συννένωση των 2 κάτω εικόνων ως προς τον άξονα y
I = cat(1,I1,I2); %Συννένωση των 2 παραπάνω διανυσμάτων ως προς τον άξονα x
imshow(I) %Εμφάνιση της εικόνας που δημιουργήθηκε από τις παραπάνω συννενώσεις
